import '../food_item1.dart';

const FoodItem food4 = FoodItem(
  name: 'ขนมถ้วยลำปาง',
  shop: 'ร้านขนมถ้วยลำปาง',
  lat: 18.29750509458569,
  lng: 99.49476278623571,
  image: 'assets/images/khanom_tuay.jpg',

  taste: 'หวานมัน เนื้อเนียน',
  benefit: 'ให้พลังงานจากกะทิและแป้ง',

  gmapLink: 'https://maps.app.goo.gl/6NQLaPrRqyq48C647',
  price: 20,

  // 🔹 เพิ่มใหม่
  type: 'หวาน', // อาหารหวาน

  recipe: '''
วัตถุดิบ:
- แป้งข้าวเจ้า
- แป้งมัน
- กะทิ
- น้ำตาล
- เกลือ

วิธีทำ:
1. ผสมแป้งข้าวเจ้า แป้งมัน น้ำตาล และกะทิ
2. เทใส่ถ้วยตะไล
3. นึ่งจนสุก
4. โรยหน้าด้วยกะทิผสมเกลือ พร้อมเสิร์ฟ
''',

  videoUrl: 'https://youtu.be/g_ukqnNPpYw?si=y-FSh8BYtMuEIa5V',
);
