import '../food_item1.dart';

const FoodItem food2 = FoodItem(
  name: 'ไส้อั่วลำปาง',
  shop: 'ร้านไส้อั่วลำปาง',
  lat: 18.28367753970465,
  lng: 99.4674687348836,
  image: 'assets/images/saiua.jpg',

  taste: 'เผ็ดร้อนกลมกล่อม หอมเครื่องเทศ',
  benefit: 'ให้โปรตีนและสมุนไพรช่วยระบบย่อยอาหาร',

  gmapLink: 'https://maps.app.goo.gl/3K3TwgRY3SKYFVCQ7',
  price: 40,

  // 🔹 เพิ่มใหม่ตามโจทย์
  type: 'คาว', // อาหารคาว

  recipe: '''
วัตถุดิบ:
- หมูสับ
- พริกแห้ง
- ข่า ตะไคร้ ใบมะกรูด
- กระเทียม
- เครื่องปรุงรส

วิธีทำ:
1. โขลกพริกแห้ง ข่า ตะไคร้ ใบมะกรูดให้ละเอียด
2. คลุกเครื่องแกงกับหมูสับ
3. ยัดใส่ไส้
4. ย่างจนสุก หอม พร้อมเสิร์ฟ
''',

  videoUrl: 'https://www.youtube.com/watch?v=jTL7nbbayaY',
);
