import '../food_item1.dart';

const FoodItem food6 = FoodItem(
  name: 'สังขยาฟักทอง',
  shop: 'ร้านสังขยาฟักทองลำปาง',
  lat: 18.29070968629183,
  lng: 99.50136730437272,
  image: 'assets/images/sangkaya.jpg',

  taste: 'หวานมัน กะทิเข้มข้น ฟักทองนุ่ม',
  benefit: 'มีวิตามิน A จากฟักทอง',

  gmapLink: 'https://maps.app.goo.gl/yW232azf17hNcNN49',
  price: 35,

  // 🔹 เพิ่มใหม่
  type: 'หวาน', // อาหารหวาน

  recipe: '''
วัตถุดิบ:
- ฟักทอง
- ไข่ไก่
- กะทิ
- น้ำตาล
- เกลือ

วิธีทำ:
1. คว้านฟักทองออกเล็กน้อย
2. ผสมไข่ กะทิ น้ำตาล และเกลือ
3. เทส่วนผสมลงในฟักทอง
4. นึ่งจนสุก เนื้อสังขยาเนียน
''',

  videoUrl: 'https://youtu.be/iYRCDM_YSxM?si=p5fYG4APLjRxiGJQ',
);
