import '../food_item1.dart';

const FoodItem food3 = FoodItem(
  name: 'ก๋วยเตี๋ยวเป็ด',
  shop: 'ร้านก๋วยเตี๋ยวเป็ดลำปาง',
  lat: 18.288223693538296,
  lng: 99.5005993085442,
  image: 'assets/images/noodle_duck.jpg',

  taste: 'น้ำซุปหอมหวาน เป็ดนุ่ม',
  benefit: 'ให้โปรตีนและคอลลาเจนจากเนื้อเป็ด',

  gmapLink: 'https://maps.app.goo.gl/scRBJ9jgGt6j5FzU8',
  price: 45,

  // 🔹 เพิ่มใหม่ตามโจทย์
  type: 'คาว', // อาหารคาว

  recipe: '''
วัตถุดิบ:
- เนื้อเป็ด
- เส้นก๋วยเตี๋ยว
- กระดูกเป็ด
- เครื่องพะโล้
- ผักบุ้ง ถั่วงอก
- เครื่องปรุงรส

วิธีทำ:
1. ต้มกระดูกเป็ดกับเครื่องพะโล้จนได้น้ำซุปหอม
2. ใส่เนื้อเป็ด ต้มจนเปื่อยนุ่ม
3. ลวกเส้นก๋วยเตี๋ยวและผัก
4. ตักน้ำซุปและเนื้อเป็ดราด พร้อมปรุงรส
''',

  videoUrl: 'https://youtu.be/993GHP56L0o?si=OKBqLjfUXbBJbV_9',
);
